jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Services/service/impl/SdStorageServiceImpl.cpp
#include "stm32f1xx_hal.h"
#include "SdStorageServiceImpl.hpp"
#include "DeviceKey.hpp"
#include "SystemClock.hpp"
#include "ff.h"
#include <cstring>
#include <cstdio>

// Wait for exFAT mount from SdBenchmarkService
extern "C" {
    extern volatile uint8_t g_exfat_ready;
}

namespace arcana {
namespace sdstorage {

uint8_t SdStorageServiceImpl::sKey[crypto::ChaCha20::KEY_SIZE] = {};

// FlashDB lock/unlock callbacks (FreeRTOS mutex)
static SemaphoreHandle_t sDbMutex = 0;
static StaticSemaphore_t sDbMutexBuf;

static void fdbLock(fdb_db_t db) {
    (void)db;
    if (sDbMutex) xSemaphoreTake(sDbMutex, portMAX_DELAY);
}

static void fdbUnlock(fdb_db_t db) {
    (void)db;
    if (sDbMutex) xSemaphoreGive(sDbMutex);
}

// FlashDB timestamp callback — must be strictly monotonic increasing.
static fdb_time_t sLastTime = 0;
static fdb_time_t fdbGetTime(void) {
    fdb_time_t now;
    if (SystemClock::getInstance().isSynced()) {
        now = (fdb_time_t)SystemClock::getInstance().now();
    } else {
        now = (fdb_time_t)xTaskGetTickCount();
    }
    if (now <= sLastTime) {
        now = sLastTime + 1;
    }
    sLastTime = now;
    return now;
}

SdStorageServiceImpl::SdStorageServiceImpl()
    : mTsdb()
    , mKvdb()
    , mDbReady(false)
    , mFal(storage::SdFalAdapter::getInstance())
    , mNonceCounter(0)
    , mTaskBuffer()
    , mTaskStack{}
    , mTaskHandle(0)
    , mRunning(false)
    , mPendingSensorData()
    , mWriteSemBuffer()
    , mWriteSem(0)
    , mHasPendingSensorData(false)
    , mAdcBatchBuffer{}
    , mAdcBatchCount(0)
    , mAdcBatchTarget(10)      // Default: 10 samples per batch
    , mAdcBatchFirstTime(0)
    , mAdcSemBuffer()
    , mAdcSem(0)
    , mHasPendingAdcData(false)
    , mStatsObs("SdStorage Stats")
    , mStats()
    , mWindowStartTick(0)
    , mWritesInWindow(0)
    , mLastRate(0)
    , mSamplesInWindow(0)
    , mLastSampleRate(0)
    , mStressTestHz(0)
    , mAdcStressTestSps(0)
{
    input.SensorData = 0;
    input.AdcData = 0;
    output.StatsEvents = &mStatsObs;
}

SdStorageServiceImpl::~SdStorageServiceImpl() {
    stop();
}

SdStorageService& SdStorageServiceImpl::getInstance() {
    static SdStorageServiceImpl sInstance;
    return sInstance;
}

ServiceStatus SdStorageServiceImpl::initHAL() {
    crypto::DeviceKey::deriveKey(sKey);
    return ServiceStatus::OK;
}

ServiceStatus SdStorageServiceImpl::init() {
    mWriteSem = xSemaphoreCreateBinaryStatic(&mWriteSemBuffer);
    if (!mWriteSem) return ServiceStatus::Error;

    mAdcSem = xSemaphoreCreateBinaryStatic(&mAdcSemBuffer);
    if (!mAdcSem) return ServiceStatus::Error;

    sDbMutex = xSemaphoreCreateMutexStatic(&sDbMutexBuf);
    if (!sDbMutex) return ServiceStatus::Error;

    return ServiceStatus::OK;
}

ServiceStatus SdStorageServiceImpl::start() {
    mRunning = true;
    mTaskHandle = xTaskCreateStatic(
        storageTask, "SdStorage", TASK_STACK_SIZE,
        this, tskIDLE_PRIORITY + 3, mTaskStack, &mTaskBuffer);
    if (!mTaskHandle) return ServiceStatus::Error;

    if (input.SensorData) {
        input.SensorData->subscribe(onSensorData, this);
    }
    if (input.AdcData) {
        input.AdcData->subscribe(onAdcData, this);
    }
    return ServiceStatus::OK;
}

void SdStorageServiceImpl::stop() {
    mRunning = false;
    if (mTaskHandle) {
        xSemaphoreGive(mWriteSem);
        xSemaphoreGive(mAdcSem);
        vTaskDelay(pdMS_TO_TICKS(50));
        mTaskHandle = 0;
    }
    if (mDbReady) {
        // Flush any pending ADC batch before shutdown
        if (mAdcBatchCount > 0) {
            flushAdcBatch();
        }
        fdb_tsdb_deinit(&mTsdb);
        fdb_kvdb_deinit(&mKvdb);
        mDbReady = false;
    }
}

void SdStorageServiceImpl::onSensorData(SensorDataModel* model, void* context) {
    SdStorageServiceImpl* self = static_cast<SdStorageServiceImpl*>(context);
    self->mPendingSensorData = *model;
    self->mHasPendingSensorData = true;
    xSemaphoreGive(self->mWriteSem);
}

void SdStorageServiceImpl::onAdcData(AdcDataModel* model, void* context) {
    SdStorageServiceImpl* self = static_cast<SdStorageServiceImpl*>(context);
    
    // Quick check and signal only - don't process in ISR/dispatcher context
    // Actual processing happens in taskLoop to avoid blocking
    if (model && model->sampleCount > 0) {
        // Store reference to current batch (thread-safe as publisher waits)
        self->mPendingAdcBatch = *model;
        self->mHasPendingAdcData = true;
        xSemaphoreGive(self->mAdcSem);
    }
}

bool SdStorageServiceImpl::configureBatchWrite(uint16_t samplesPerBatch) {
    if (samplesPerBatch == 0 || samplesPerBatch > MAX_BATCH_SAMPLES) {
        return false;
    }
    mAdcBatchTarget = samplesPerBatch;
    mStats.batchSize = samplesPerBatch;
    return true;
}

bool SdStorageServiceImpl::flushBatch() {
    if (!mDbReady) return false;
    if (mAdcBatchCount > 0) {
        flushAdcBatch();
        mFal.sync();  // Force sync to SD card
        return true;
    }
    return false;
}

void SdStorageServiceImpl::storageTask(void* param) {
    SdStorageServiceImpl* self = static_cast<SdStorageServiceImpl*>(param);
    uint32_t startTick = xTaskGetTickCount();
    printf("[SdStorage] Task started at tick %lu\n", startTick);

    // Wait for exFAT filesystem to be ready
    int waitCount = 0;
    const int MAX_WAIT = 300;
    printf("[SdStorage] Waiting for exFAT ready...\n");
    while (!g_exfat_ready && self->mRunning && waitCount < MAX_WAIT) {
        vTaskDelay(pdMS_TO_TICKS(100));
        waitCount++;
        if (waitCount % 10 == 0) {
            printf("[SdStorage] Waiting for exFAT... %d/300\n", waitCount);
        }
    }
    uint32_t exfatTick = xTaskGetTickCount();
    printf("[SdStorage] exFAT ready after %lu ms\n", (exfatTick - startTick) * portTICK_PERIOD_MS);
    
    if (!self->mRunning) { vTaskDelete(0); return; }

    // Initialize FAL adapter
    printf("[SdStorage] Initializing FAL adapter...\n");
    uint32_t falStartTick = xTaskGetTickCount();
    if (!self->mFal.init()) {
        printf("[SdStorage] FAL init FAILED!\n");
        vTaskDelete(0);
        return;
    }
    uint32_t falEndTick = xTaskGetTickCount();
    printf("[SdStorage] FAL init OK (%lu ms)\n", (falEndTick - falStartTick) * portTICK_PERIOD_MS);

