jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Services/service/impl/SdStorageServiceImpl.cpp
    uint8_t blob[BLOB_SIZE];
    uint8_t* nonce = blob;
    uint8_t* payload = blob + 12;

    uint32_t tick = (uint32_t)xTaskGetTickCount();
    makeNonce(nonce, mNonceCounter, tick);

    serializePayload(model, payload);
    crypto::ChaCha20::crypt(sKey, nonce, 0, payload, PAYLOAD_SIZE);

    struct fdb_blob fblob;
    fdb_err_t err = fdb_tsl_append(&mTsdb, fdb_blob_make(&fblob, blob, BLOB_SIZE));
    if (err == FDB_NO_ERR) {
        mNonceCounter++;
        mWritesInWindow++;
        updateStats();
    } else {
        if (++sErrCnt <= 20) {
            printf("[SdStorage] fdb_tsl_append error: %d at nonce=%lu\n", err, mNonceCounter);
        }
    }
}

void SdStorageServiceImpl::appendAdcSample(const AdcDataModel* model) {
    if (!mDbReady) return;

    // Add sample to batch buffer
    uint16_t sampleBytes = model->activeChannels * AdcDataModel::BYTES_PER_CHANNEL;
    
    if (mAdcBatchCount == 0) {
        mAdcBatchFirstTime = model->firstTimestamp;
    }

    // Copy sample data to batch buffer
    uint16_t offset = mAdcBatchCount * AdcDataModel::SAMPLE_SIZE;
    if (offset + sampleBytes <= sizeof(mAdcBatchBuffer)) {
        memcpy(&mAdcBatchBuffer[offset], model->sampleBuffer, sampleBytes);
        mAdcBatchCount++;
        mSamplesInWindow++;
    }

    // Flush batch if target reached
    if (mAdcBatchCount >= mAdcBatchTarget) {
        flushAdcBatch();
    }

    updateStats();
}

void SdStorageServiceImpl::flushAdcBatch() {
    if (!mDbReady || mAdcBatchCount == 0) return;

    // Build batch blob: [nonce:12][metadata:16][encrypted_samples:N]
    uint8_t blob[MAX_BATCH_BLOB_SIZE];
    uint8_t* nonce = blob;
    uint8_t* metadata = blob + 12;
    uint8_t* samples = blob + 28;

    uint32_t tick = (uint32_t)xTaskGetTickCount();
    makeNonce(nonce, mNonceCounter, tick);

    // Metadata: [version:1][sample_count:2][channel_mask:1][sample_rate:2][timestamp:4][reserved:6]
    metadata[0] = 1;  // Version
    metadata[1] = mAdcBatchCount & 0xFF;
    metadata[2] = (mAdcBatchCount >> 8) & 0xFF;
    metadata[3] = 0xFF;  // All channels active
    metadata[4] = 1000 & 0xFF;  // Sample rate low
    metadata[5] = (1000 >> 8) & 0xFF;  // Sample rate high
    metadata[6] = mAdcBatchFirstTime & 0xFF;
    metadata[7] = (mAdcBatchFirstTime >> 8) & 0xFF;
    metadata[8] = (mAdcBatchFirstTime >> 16) & 0xFF;
    metadata[9] = (mAdcBatchFirstTime >> 24) & 0xFF;
    memset(&metadata[10], 0, 6);  // Reserved

    // Copy samples
    uint16_t samplesLen = mAdcBatchCount * AdcDataModel::SAMPLE_SIZE;
    memcpy(samples, mAdcBatchBuffer, samplesLen);

    // Encrypt metadata + samples
    crypto::ChaCha20::crypt(sKey, nonce, 0, metadata, 16 + samplesLen);

    // Append to TSDB
    struct fdb_blob fblob;
    uint32_t blobLen = 28 + samplesLen;
    fdb_err_t err = fdb_tsl_append(&mTsdb, fdb_blob_make(&fblob, blob, blobLen));
    
    if (err == FDB_NO_ERR) {
        mNonceCounter++;
        mWritesInWindow++;
    }

    // Clear batch buffer
    mAdcBatchCount = 0;
    memset(mAdcBatchBuffer, 0, sizeof(mAdcBatchBuffer));
}

void SdStorageServiceImpl::updateStats() {
    static volatile uint32_t* const DWT_CYCCNT_PTR = (volatile uint32_t*)0xE0001004;
    uint32_t now = *DWT_CYCCNT_PTR;

    if (mWindowStartTick == 0) {
        mWindowStartTick = now;
    }

    uint32_t elapsed = now - mWindowStartTick;
    uint32_t elapsedMs = elapsed / (SystemCoreClock / 1000);

    if (elapsedMs >= 1000) {
        mLastRate = mWritesInWindow;
        mLastSampleRate = mSamplesInWindow;
        mWritesInWindow = 0;
        mSamplesInWindow = 0;
        mWindowStartTick = now;
    }

    // Publish at most ~4/sec to avoid flooding ObservableDispatcher at high write rates
    static uint8_t sPublishDiv = 0;
    if (++sPublishDiv >= 10) {
        sPublishDiv = 0;
        mStats.recordCount = mNonceCounter;
        mStats.writesPerSec = mLastRate;
        mStats.samplesPerSec = mLastSampleRate;
        mStats.batchSize = mAdcBatchTarget;
        mStats.updateTimestamp();
        mStatsObs.publish(&mStats);
    }
}

void SdStorageServiceImpl::makeNonce(uint8_t nonce[12],
                                      uint32_t counter, uint32_t tick) {
    nonce[0]  = (counter >>  0) & 0xFF;
    nonce[1]  = (counter >>  8) & 0xFF;
    nonce[2]  = (counter >> 16) & 0xFF;
    nonce[3]  = (counter >> 24) & 0xFF;
    nonce[4]  = (tick >>  0) & 0xFF;
    nonce[5]  = (tick >>  8) & 0xFF;
    nonce[6]  = (tick >> 16) & 0xFF;
    nonce[7]  = (tick >> 24) & 0xFF;
    nonce[8]  = 0;
    nonce[9]  = 0;
    nonce[10] = 0;
    nonce[11] = 0;
}

void SdStorageServiceImpl::serializePayload(const SensorDataModel* model, uint8_t* buf) {
    uint32_t ts = model->timestamp;
    buf[0] = (ts >>  0) & 0xFF;
    buf[1] = (ts >>  8) & 0xFF;
    buf[2] = (ts >> 16) & 0xFF;
    buf[3] = (ts >> 24) & 0xFF;

    uint32_t temp;
    memcpy(&temp, &model->temperature, 4);
    buf[4] = (temp >>  0) & 0xFF;
    buf[5] = (temp >>  8) & 0xFF;
    buf[6] = (temp >> 16) & 0xFF;
    buf[7] = (temp >> 24) & 0xFF;

    buf[8]  = (uint8_t)(model->accelX & 0xFF);
    buf[9]  = (uint8_t)((model->accelX >> 8) & 0xFF);
    buf[10] = (uint8_t)(model->accelY & 0xFF);
    buf[11] = (uint8_t)((model->accelY >> 8) & 0xFF);
    buf[12] = (uint8_t)(model->accelZ & 0xFF);
    buf[13] = (uint8_t)((model->accelZ >> 8) & 0xFF);
}

void SdStorageServiceImpl::deserializePayload(const uint8_t* buf, SensorDataModel* model) {
    model->timestamp = (uint32_t)buf[0]       | ((uint32_t)buf[1] << 8) |
                       ((uint32_t)buf[2] << 16) | ((uint32_t)buf[3] << 24);

    uint32_t temp = (uint32_t)buf[4]       | ((uint32_t)buf[5] << 8) |
                    ((uint32_t)buf[6] << 16) | ((uint32_t)buf[7] << 24);
    memcpy(&model->temperature, &temp, 4);

    model->accelX = (int16_t)((uint16_t)buf[8]  | ((uint16_t)buf[9] << 8));
    model->accelY = (int16_t)((uint16_t)buf[10] | ((uint16_t)buf[11] << 8));
    model->accelZ = (int16_t)((uint16_t)buf[12] | ((uint16_t)buf[13] << 8));
}

void SdStorageServiceImpl::serializeAdcBatch(const uint8_t* samples, uint16_t count, 
                                              uint32_t timestamp, uint8_t* buf, uint32_t& outLen) {
    // Metadata format used in flushAdcBatch
    (void)samples;
    (void)count;
    (void)timestamp;
    (void)buf;
    outLen = 0;
}

