jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Services/service/impl/SdStorageServiceImpl.cpp
// ============================================================
// Daily .enc export
// ============================================================

struct ExportCtx {
    SdStorageServiceImpl* self;
    FIL* fp;
    uint32_t count;
    bool ok;
};

bool SdStorageServiceImpl::exportIterCb(fdb_tsl_t tsl, void* arg) {
    ExportCtx* ctx = static_cast<ExportCtx*>(arg);
    if (tsl->status != FDB_TSL_WRITE) return false;

    uint8_t blob[512];  // Max batch blob size
    struct fdb_blob fblob;
    fdb_blob_make(&fblob, blob, sizeof(blob));
    fblob.saved.addr = tsl->addr.log;
    fblob.saved.len = tsl->log_len;
    
    if (fdb_blob_read((fdb_db_t)&ctx->self->mTsdb, &fblob) != (int)tsl->log_len) {
        return false;
    }

    UINT written;
    FRESULT fr = f_write(ctx->fp, blob, tsl->log_len, &written);
    if (fr != FR_OK || written != tsl->log_len) {
        ctx->ok = false;
        return true;
    }
    ctx->count++;
    return false;
}

bool SdStorageServiceImpl::writeEncFileHeader(FIL* fp, uint32_t recordCount) {
    uint8_t header[8];
    header[0] = 'A';
    header[1] = 'E';
    header[2] = 1;
    header[3] = BLOB_SIZE;
    header[4] = (recordCount >>  0) & 0xFF;
    header[5] = (recordCount >>  8) & 0xFF;
    header[6] = (recordCount >> 16) & 0xFF;
    header[7] = (recordCount >> 24) & 0xFF;

    UINT written;
    FRESULT fr = f_write(fp, header, sizeof(header), &written);
    return (fr == FR_OK && written == sizeof(header));
}

static uint32_t dateToEpoch(uint32_t dateYYYYMMDD) {
    uint32_t y = dateYYYYMMDD / 10000;
    uint32_t m = (dateYYYYMMDD / 100) % 100;
    uint32_t d = dateYYYYMMDD % 100;
    if (m <= 2) { y--; m += 9; } else { m -= 3; }
    uint32_t era = y / 400;
    uint32_t yoe = y - era * 400;
    uint32_t doy = (153 * m + 2) / 5 + d - 1;
    uint32_t doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
    int32_t days = (int32_t)(era * 146097 + doe) - 719468;
    return (uint32_t)days * 86400;
}

bool SdStorageServiceImpl::exportDailyFile(uint32_t dateYYYYMMDD) {
    if (!mDbReady) return false;

    char fname[16];
    snprintf(fname, sizeof(fname), "%08lu.enc", (unsigned long)dateYYYYMMDD);

    FIL fp;
    FRESULT fr = f_open(&fp, fname, FA_CREATE_ALWAYS | FA_WRITE);
    if (fr != FR_OK) return false;

    if (!writeEncFileHeader(&fp, 0)) {
        f_close(&fp);
        return false;
    }

    ExportCtx ctx;
    ctx.self = this;
    ctx.fp = &fp;
    ctx.count = 0;
    ctx.ok = true;

    uint32_t dayStart = dateToEpoch(dateYYYYMMDD);
    uint32_t dayEnd = dayStart + 86400 - 1;
    fdb_tsl_iter_by_time(&mTsdb, dayStart, dayEnd, exportIterCb, &ctx);

    if (!ctx.ok || ctx.count == 0) {
        f_close(&fp);
        f_unlink(fname);
        return false;
    }

    f_lseek(&fp, 0);
    writeEncFileHeader(&fp, ctx.count);
    f_close(&fp);

    return true;
}

// ============================================================
// KVDB upload tracking
// ============================================================

bool SdStorageServiceImpl::isDateUploaded(uint32_t dateYYYYMMDD) {
    if (!mDbReady) return false;

    char key[12];
    snprintf(key, sizeof(key), "%08lu", (unsigned long)dateYYYYMMDD);

    uint8_t val = 0;
    struct fdb_blob blob;
    fdb_blob_make(&blob, &val, sizeof(val));
    size_t len = fdb_kv_get_blob(&mKvdb, key, &blob);
    return (len == sizeof(val) && val == 1);
}

bool SdStorageServiceImpl::markDateUploaded(uint32_t dateYYYYMMDD) {
    if (!mDbReady) return false;

    char key[12];
    snprintf(key, sizeof(key), "%08lu", (unsigned long)dateYYYYMMDD);

    uint8_t val = 1;
    struct fdb_blob blob;
    fdb_blob_make(&blob, &val, sizeof(val));
    fdb_err_t err = fdb_kv_set_blob(&mKvdb, key, &blob);
    return (err == FDB_NO_ERR);
}

// ============================================================
// Query helpers
// ============================================================

bool SdStorageServiceImpl::queryIterCb(fdb_tsl_t tsl, void* arg) {
    QueryCtx* ctx = static_cast<QueryCtx*>(arg);
    if (ctx->count >= ctx->maxCount) return true;
    if (tsl->status != FDB_TSL_WRITE) return false;

    uint8_t blob[BLOB_SIZE];
    struct fdb_blob fblob;
    fdb_blob_make(&fblob, blob, BLOB_SIZE);
    fblob.saved.addr = tsl->addr.log;
    fblob.saved.len = tsl->log_len;
    
    // Skip if blob is too large (batch record)
    if (tsl->log_len != BLOB_SIZE) return false;
    
    if (fdb_blob_read((fdb_db_t)&ctx->self->mTsdb, &fblob) != BLOB_SIZE) {
        return false;
    }

    uint8_t* nonce = blob;
    uint8_t* payload = blob + 12;
    crypto::ChaCha20::crypt(sKey, nonce, 0, payload, PAYLOAD_SIZE);

    ctx->self->deserializePayload(payload, &ctx->out[ctx->count]);
    ctx->count++;
    return false;
}

uint16_t SdStorageServiceImpl::queryByDate(uint32_t dateYYYYMMDD,
                                            SensorDataModel* out, uint16_t maxCount) {
    if (!mDbReady) return 0;

    QueryCtx ctx;
    ctx.self = this;
    ctx.out = out;
    ctx.maxCount = maxCount;
    ctx.count = 0;

    uint32_t dayStart = dateToEpoch(dateYYYYMMDD);
    uint32_t dayEnd = dayStart + 86400 - 1;
    fdb_tsl_iter_by_time(&mTsdb, dayStart, dayEnd, queryIterCb, &ctx);

    return ctx.count;
}

uint32_t SdStorageServiceImpl::queryAdcByTimeRange(uint32_t startTime, uint32_t endTime,
                                                    AdcDataModel* out, uint16_t maxBatches) {
    if (!mDbReady) return 0;
    // TODO: Implement ADC batch query and deserialization
    (void)startTime;
    (void)endTime;
    (void)out;
    (void)maxBatches;
    return 0;
}

void SdStorageServiceImpl::publishStats() {
    mStats.updateTimestamp();
    mStatsObs.publish(&mStats);
}

void SdStorageServiceImpl::enableStressTest(uint16_t hz) {
    mStressTestHz = hz;
}

void SdStorageServiceImpl::enableAdcStressTest(uint16_t sps, uint16_t batchSize) {
    mAdcStressTestSps = sps;
    if (batchSize > 0 && batchSize <= MAX_BATCH_SAMPLES) {
        mAdcBatchTarget = batchSize;
    }
    printf("[SdStorage] ADC stress test: %u SPS, batch=%u\n", sps, mAdcBatchTarget);
}

void SdStorageServiceImpl::appendDummyRecord() {
    if (!mDbReady) return;

    SensorDataModel dummy;
    dummy.temperature = 25.0f + (float)(mNonceCounter % 100) * 0.01f;
    dummy.accelX = (int16_t)(mNonceCounter & 0x7FFF);
    dummy.accelY = 0;
    dummy.accelZ = 0;
    dummy.updateTimestamp();
    appendRecord(&dummy);
}

void SdStorageServiceImpl::appendDummyAdcBatch() {
    if (!mDbReady) return;

    // Generate dummy 8-channel ADC samples
    // Each sample: 8 channels × 3 bytes = 24 bytes
    for (uint16_t i = 0; i < mAdcBatchTarget && mAdcBatchCount < MAX_BATCH_SAMPLES; i++) {
        uint16_t offset = mAdcBatchCount * AdcDataModel::SAMPLE_SIZE;
        
        // Generate 8 channels of 24-bit data (3 bytes each)
        for (uint8_t ch = 0; ch < 8; ch++) {
            // Dummy pattern: channel index + sample counter
            uint32_t value = ((mNonceCounter + mAdcBatchCount) * 8 + ch) & 0xFFFFFF;
            mAdcBatchBuffer[offset + ch * 3 + 0] = (value >> 0) & 0xFF;
            mAdcBatchBuffer[offset + ch * 3 + 1] = (value >> 8) & 0xFF;
            mAdcBatchBuffer[offset + ch * 3 + 2] = (value >> 16) & 0xFF;
        }
        
        mAdcBatchCount++;
        mSamplesInWindow++;
    }
    
    // Flush batch immediately
    flushAdcBatch();
}

} // namespace sdstorage
} // namespace arcana
